In [1]:
import pandas as pd

In [7]:
pd.read_csv("E:/Data Science class/Datasets/Sal.csv")

   10  101  Abhinav Srivastava   5000.0
0  10  102  Vaibhav      Bajaj  6000.00
1  20  103      Jay       Soni  7000.08
2  20  104   Vishal   Bayaskar  8000.00
3  30  105   Anurag       Goel  9000.00

In [8]:
cols=["DID","EMPID","FN","LN","SL"]

In [9]:
A=pd.read_csv("E:/Data Science class/Datasets/Sal.csv",names=cols)

In [10]:
A

   DID  EMPID       FN          LN       SL
0   10    101  Abhinav  Srivastava  5000.00
1   10    102  Vaibhav       Bajaj  6000.00
2   20    103      Jay        Soni  7000.08
3   20    104   Vishal    Bayaskar  8000.00
4   30    105   Anurag        Goel  9000.00

In [12]:
tax=[]

In [22]:
tax = []
for i in A.SL:
   if(i < 7500):
       tax.append(i * 0.1)
   else:
       tax.append(i * 0.2)

In [23]:
tax

[500.0, 600.0, 700.008, 1600.0, 1800.0]

In [24]:
A["TAX"]=tax

In [25]:
A

   DID  EMPID       FN          LN       SL       TAX
0   10    101  Abhinav  Srivastava  5000.00   500.000
1   10    102  Vaibhav       Bajaj  6000.00   600.000
2   20    103      Jay        Soni  7000.08   700.008
3   20    104   Vishal    Bayaskar  8000.00  1600.000
4   30    105   Anurag        Goel  9000.00  1800.000

In [27]:
A

   DID  EMPID       FN          LN       SL       TAX
0   10    101  Abhinav  Srivastava  5000.00   500.000
1   10    102  Vaibhav       Bajaj  6000.00   600.000
2   20    103      Jay        Soni  7000.08   700.008
3   20    104   Vishal    Bayaskar  8000.00  1600.000
4   30    105   Anurag        Goel  9000.00  1800.000

In [28]:
A["LN"]

0    Srivastava
1         Bajaj
2          Soni
3      Bayaskar
4          Goel
Name: LN, dtype: object

In [29]:
A[["TAX"]]

        TAX
0   500.000
1   600.000
2   700.008
3  1600.000
4  1800.000

In [30]:
type(A[["TAX"]])

pandas.core.frame.DataFrame

In [31]:
type(A["LN"])

pandas.core.series.Series

In [32]:
A

   DID  EMPID       FN          LN       SL       TAX
0   10    101  Abhinav  Srivastava  5000.00   500.000
1   10    102  Vaibhav       Bajaj  6000.00   600.000
2   20    103      Jay        Soni  7000.08   700.008
3   20    104   Vishal    Bayaskar  8000.00  1600.000
4   30    105   Anurag        Goel  9000.00  1800.000

In [2]:
A.columns

NameError: name 'A' is not defined

In [34]:
A.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
DID      5 non-null int64
EMPID    5 non-null int64
FN       5 non-null object
LN       5 non-null object
SL       5 non-null float64
TAX      5 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 320.0+ bytes

In [35]:
tax=[1,2,3,4,5]

In [36]:
A["NEW"]=tax

In [37]:
A

   DID  EMPID       FN          LN       SL       TAX  NEW
0   10    101  Abhinav  Srivastava  5000.00   500.000    1
1   10    102  Vaibhav       Bajaj  6000.00   600.000    2
2   20    103      Jay        Soni  7000.08   700.008    3
3   20    104   Vishal    Bayaskar  8000.00  1600.000    4
4   30    105   Anurag        Goel  9000.00  1800.000    5

In [39]:
A.DID

0    10
1    10
2    20
3    20
4    30
Name: DID, dtype: int64

In [40]:
A

   DID  EMPID       FN          LN       SL       TAX  NEW
0   10    101  Abhinav  Srivastava  5000.00   500.000    1
1   10    102  Vaibhav       Bajaj  6000.00   600.000    2
2   20    103      Jay        Soni  7000.08   700.008    3
3   20    104   Vishal    Bayaskar  8000.00  1600.000    4
4   30    105   Anurag        Goel  9000.00  1800.000    5

In [42]:
A.drop(labels="NEW",axis=1)

   DID  EMPID       FN          LN       SL       TAX
0   10    101  Abhinav  Srivastava  5000.00   500.000
1   10    102  Vaibhav       Bajaj  6000.00   600.000
2   20    103      Jay        Soni  7000.08   700.008
3   20    104   Vishal    Bayaskar  8000.00  1600.000
4   30    105   Anurag        Goel  9000.00  1800.000

In [43]:
City=["Pune","Mumbai","Nagpur","Delhi","Kolkata"]

In [44]:
A["CITY"]=City

In [45]:
A

   DID  EMPID       FN          LN       SL       TAX  NEW     CITY
0   10    101  Abhinav  Srivastava  5000.00   500.000    1     Pune
1   10    102  Vaibhav       Bajaj  6000.00   600.000    2   Mumbai
2   20    103      Jay        Soni  7000.08   700.008    3   Nagpur
3   20    104   Vishal    Bayaskar  8000.00  1600.000    4    Delhi
4   30    105   Anurag        Goel  9000.00  1800.000    5  Kolkata

In [46]:
A.drop(axis=1,labels="CITY")

   DID  EMPID       FN          LN       SL       TAX  NEW
0   10    101  Abhinav  Srivastava  5000.00   500.000    1
1   10    102  Vaibhav       Bajaj  6000.00   600.000    2
2   20    103      Jay        Soni  7000.08   700.008    3
3   20    104   Vishal    Bayaskar  8000.00  1600.000    4
4   30    105   Anurag        Goel  9000.00  1800.000    5

In [48]:
A

   DID  EMPID       FN          LN       SL       TAX  NEW     CITY
0   10    101  Abhinav  Srivastava  5000.00   500.000    1     Pune
1   10    102  Vaibhav       Bajaj  6000.00   600.000    2   Mumbai
2   20    103      Jay        Soni  7000.08   700.008    3   Nagpur
3   20    104   Vishal    Bayaskar  8000.00  1600.000    4    Delhi
4   30    105   Anurag        Goel  9000.00  1800.000    5  Kolkata

In [1]:
Z=[1,2,3,4,5]

In [2]:
F={}

In [4]:
Z

[1, 1, 3, 4, 5]

In [5]:
Z=[1,2,3,4,5]
for i in Z:
    i=i**2

In [6]:
Z

[1, 2, 3, 4, 5]

In [7]:
Z=[1,2,3,4,5]
for i in Z:
    i=i**2
    i=Z

In [8]:
Z

[1, 2, 3, 4, 5]